# ============================================================================
# ========================== HeapSort Algorithm ==============================
# ============================================================================


# Пирамидальная сортировка (heap sort). Вычислительная мощность: Θ(𝑛 log 𝑛).
# Сложность по памяти: 𝑂(1). Свойства: неустойчивая.
# Алгоритм сортировки называется устойчивым (stable), если он сохраняет
# относительный порядок следования одинаковых ключей.

# To heapify subtree rooted at index i.
# n is size of heap


def heapify(arr, n, i):
    largest = i
    l = 2 * i + 1
    r = 2 * i + 2
    if l < n and arr[i] < arr[l]:
        largest = l
    if r < n and arr[largest] < arr[r]:
        largest = r
    if largest != i:
        arr[i], arr[largest] = arr[largest], arr[i]
        heapify(arr, n, largest)


def heap_sort(arr):
    n = len(arr)
    for i in range(n, -1, -1):
        heapify(arr, n, i)
    for i in range(n - 1, 0, -1):
        arr[i], arr[0] = arr[0], arr[i]
        heapify(arr, i, 0)


h = [1, 38, 2, 3, 9, 10, 22, 31, 25, 19]
heap_sort(h)
print(h)
